{
  "sort": 0,
  "name": "Rulings",
  "type": "text",
  "_id": "9nF9I33L7c69uMMf",
  "title": {
    "show": true,
    "level": 1
  },
  "image": {},
  "text": {
    "format": 1,
    "content": "<p>This system follows Hackmaster, <em>Rules as Written</em>, whenever possible. While comprehensive, the game's realistic nature can lead to edge cases where no rule can tell a Game Master what to do and it became necessary for to make decisions on behalf of the Game Master. This journal documents these decisions so the Game Master and their Players are aware of them.</p><h2>Rules Priority</h2><p>Newer books supersede older books if their rules are contradictory. In increasing order of priority:</p><ul><li><p>Player's Handbook</p></li><li><p>Game Master's Guide</p></li></ul><p>This system also makes use of the <a href=\"https://docs.google.com/document/d/1al7LYCJ497_8zLwFYwImk9mzbKXySrdzF0LPKSF5hFA/edit?usp=sharing\">Community Rules Errata</a>, which is maintained by the community. The errata contains game revisions made by the Official Hackmaster D-Team as well as some community decisions. Replies in green text are from the D-Team and treated as official. You are encouraged to review this document.</p><h2>System Rules</h2><p>The following decisions were made on behalf of Game Masters for the sake of automation:</p><p><strong>Half Damage Dice</strong></p><p>The procedure for halving a damage dice formula is as follows:</p><ol><li><p>Halve the number of dice (rounded down) for each term.</p></li><li><p>If a term's dice could not be halved (a singular die), then halve the number of faces, rounded down.</p></li></ol><h4><strong>Hurled Ranged Weapons with Negative Strength Damage Mod</strong></h4><p>Physically weak characters with damage penalties due to strength will receive their strength mod to non-mechanical ranged weapons. If a player indicates he has moved 10 feet/sec or faster, this strength penalty no longer applies.</p><h4><strong>Beast Attribute Bonus</strong></h4><p>Any time the rules refer to a player losing a bonus gained from attribute scores (which beasts lack), a penalty of -2 is applied to the beast, instead.</p><h4><strong>Tough as Nails and Extended Trauma Rules</strong></h4><p>Characters with a custom trauma die will roll a d20 for <em>Extended Trauma</em> checks, rather than their custom die.</p>",
    "markdown": ""
  },
  "video": {
    "controls": true,
    "volume": 0.5
  },
  "src": null,
  "system": {},
  "ownership": {
    "default": -1
  },
  "flags": {},
  "_key": "!journal.pages!IE2BBYp8sIMeUBUi.9nF9I33L7c69uMMf"
}